---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PlanRegionFailures.Intersecting
source: html/84be37b4-0179-39f4-d1ab-01ceff12ae48.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PlanRegionFailures.Intersecting Property

The boundaries of the highlighted Plan Regions overlap.

## Syntax (C#)
```csharp
public static FailureDefinitionId Intersecting { get; }
```